#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.
number_list = [2, 5, 10, 32, 12, 67, 96, 43, 82, 1]
for number in number_list:
	number +=1
	print (number)