#Ввести с клавиатуры строку.
#Вывести эту же строку вертикально: по одному символу на строку консоли.
line = str(input('Введите строку: '))
for symb in line:
    print(symb)
      